---
kind: type
id: T:Autodesk.Revit.DB.ModelLine
source: html/52b40d5e-8a43-0dd7-035b-ae9de12d024e.htm
---
# Autodesk.Revit.DB.ModelLine

Represents a ModelLine within Autodesk Revit.

## Syntax (C#)
```csharp
public class ModelLine : ModelCurve
```

## Remarks
Geometry-related functionality is provided by the geometry curve object from the
ModelCurve::geometryCurve property.